---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipePressureDropData.KLevel
source: html/c39ca077-b584-142a-343d-2ee14dcf80be.htm
---
# Autodesk.Revit.DB.Plumbing.PipePressureDropData.KLevel Property

The system calculation level.

## Syntax (C#)
```csharp
public SystemCalculationLevel KLevel { get; }
```